app/models/seat.rb

	def check_capacity
	seats = Seat.where(flight_id: flight_id).length
	capacity = Flight.find(flight_id).capacity
---
SELECT "seats".* FROM "seats" WHERE "seats"."flight_id" = ?  [["flight_id", 2]]
SELECT  "flights".* FROM "flights" WHERE "flights"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

	def check_baggage
	seats = Seat.where(flight_id: flight_id)

sum_baggage = 0

seats.each do |s|
	sum_baggage += s.baggage.to_f
end

	ba = Flight.find(flight_id).baggage_allowance
---
SELECT "seats".* FROM "seats" WHERE "seats"."flight_id" = ?  [["flight_id", 2]]
SELECT  "flights".* FROM "flights" WHERE "flights"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]